"+ Add" = "+ เพิ่ม";

"Add US bank account" = "เพิ่มบัญชีธนาคารในสหรัฐอเมริกา";

"Add a card" = "เพิ่มบัตร";

"Add a payment method" = "เพิ่มวิธีการชำระเงิน";

"Add bank account" = "เพิ่มบัญชีธนาคาร";

"Add card" = "เพิ่มบัตร";

"Add new card" = "เพิ่มบัตรใหม่";

"Add new payment method" = "เพิ่มวิธีการชำระเงินใหม่";

"Add your payment information" = "เพิ่มข้อมูลการชำระเงิน";

"Approve payment" = "อนุมัติการชำระเงิน";

"Are you sure you want to remove this card?" = "แน่ใจไหมว่าต้องการนำบัตรใบนี้ออก";

"Are you sure you want to remove this linked account?" = "แน่ใจไหมว่าต้องการนำบัญชีที่ลิงก์นี้ออก";

"Back" = "ย้อนกลับ";

"Bank" = "ธนาคาร";

"Bank account" = "บัญชีธนาคาร";

"Bank account details cannot be changed." = "เปลี่ยนแปลงรายละเอียดบัญชีธนาคารไม่ได้";

"Buy now or pay later with  <img/>" = "ซื้อตอนนี้หรือจ่ายทีหลังด้วย <img/>";

"Buy now or pay later with Afterpay" = "ซื้อตอนนี้หรือจ่ายทีหลังด้วย Afterpay";

"Buy now or pay later with Cash App Afterpay" = "ซื้อตอนนี้หรือจ่ายทีหลังด้วย Cash App Afterpay";

"Buy now or pay later with Clearpay" = "ซื้อตอนนี้หรือจ่ายทีหลังด้วย Clearpay";

"Buy now or pay later with Klarna" = "ซื้อตอนนี้หรือจ่ายทีหลังด้วย Klarna";

"Buy using a UPI ID" = "ซื้อโดยใช้ UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "การยืนยันการการชำระเงินด้วย PayPal หมายความว่าคุณอนุญาตให้ %@ เรียกเก็บเงินจากบัญชี PayPal ของคุณสำหรับการชำระเงินในอนาคตตามเงื่อนไขของผู้ค้ารายดังกล่าว";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "การดำเนินการต่อที่ Amazon Pay หมายความว่าคุณอนุญาตให้ %@ เรียกเก็บเงินจากบัญชี Amazon Pay ของคุณสำหรับการชำระเงินในอนาคตตามเงื่อนไขของผู้ค้ารายดังกล่าว";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "การดำเนินการต่อที่ Klana หมายความว่าคุณอนุญาตให้ %1$@ เรียกเก็บเงินจากบัญชี Klana ของคุณสำหรับการชำระเงินในอนาคตตามเงื่อนไขของผู้ค้ารายดังกล่าว คุณสามารถเปลี่ยนการอนุญาตนี้ได้ทุกเมื่อในแอป Klana หรือติดต่อที่ %2$@";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "การดำเนินการต่อที่ PayPal หมายความว่าคุณอนุญาตให้ %@ เรียกเก็บเงินจากบัญชี PayPal ของคุณสำหรับการชำระเงินในอนาคตตามเงื่อนไขของผู้ค้ารายดังกล่าว";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "การดำเนินการต่อที่ Revolut Pay หมายความว่าคุณอนุญาตให้ %@ เรียกเก็บเงินจากบัญชี Revolut Pay ของคุณสำหรับการชำระเงินในอนาคตตามเงื่อนไขของผู้ค้ารายดังกล่าว";

"By continuing you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "การดำเนินการต่อหมายความว่าคุณยอมรับ<terms>ข้อกำหนด</terms>และ<privacy>นโยบายความเป็นส่วนตัว</privacy>";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "การดำเนินการต่อหมายความว่าคุณตกลงที่จะอนุมัติการชำระเงินซึ่งดำเนินการตาม<terms>ข้อกำหนดเหล่านี้</terms>";

"By continuing, you agree to save your information for future purchases with %@ and <link>Link</link> according to Link <terms>terms</terms> and <privacy>privacy</privacy>." = "เมื่อดำเนินการต่อ แสดงว่าคุณยินยอมที่จะบันทึกข้อมูลไว้สำหรับการซื้อด้วย %@ ในอนาคต และ <link>Link</link> ตาม<terms>ข้อกำหนด</terms>และ<privacy>ความเป็นส่วนตัว</privacy>ของ Link";

"By continuing, you agree to save your information for future purchases with %@." = "เมื่อดำเนินการต่อ จะถือว่าคุณตกลงที่จะบันทึกข้อมูลไว้สําหรับการซื้อด้วย %@ ในอนาคต";

"By continuing, you authorize %@ to automatically debit your Satispay Balance on a recurring basis in accordance with your purchase or subscription plan." = "การดำเนินการต่อแปลว่าคุณอนุญาตให้ %@ หักเงินจากยอดเงิน Satispay ของคุณโดยอัตโนมัติตามระยะเวลาที่กำหนดตามแผนการซื้อหรือการสมัครสมาชิกของคุณ";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "การดำเนินการต่อ หมายความว่าคุณอนุญาตให้ %1$@ ฝากเงินเข้าบัญชี Cash App ของคุณสำหรับการชำระเงินรายการนี้ และการชำระเงินในอนาคตโดยสอดคล้องกับข้อกำหนดของ %2$@ จนกว่าจะมีการเพิกถอนการอนุญาต คุณสามารถเปลี่ยนแปลงการตั้งค่านี้ได้ทุกเมื่อในการตั้งค่า Cash App";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "การเข้าร่วม Link หมายถึงคุณยอมรับ<terms>ข้อกำหนด</terms>และ<privacy>นโยบายความเป็นส่วนตัว</privacy>";

"By providing phone number and email, you agree to create a Link account subject to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "การให้หมายเลขโทรศัพท์และอีเมลหมายความว่าคุณยินยอมที่จะสร้างบัญชี Link ที่อยู่ภายใต้<terms>ข้อกำหนด</terms>และ<privacy>นโยบายความเป็นส่วนตัว</privacy>ของ Link";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "การให้รายละเอียดบัญชีธนาคารของคุณและยืนยันการชำระเงินนี้แปลว่าคุณตกลงตามคำขอหักเงินในบัญชีโดยตรงนี้และ<terms>ข้อตกลงบริการคำขอหักเงินในบัญชีโดยตรง</terms> และอนุญาตให้ Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID หมายเลข 507156 (“Stripe”) หักเงินจากบัญชีของคุณผ่านระบบ Bulk Electronic Clearing System (BECS) ในนามของ %@ (\"ผู้ค้า\") เป็นจำนวนเงินที่ผู้ค้าแจ้งให้คุณทราบแยกต่างหาก คุณรับรองว่าคุณเป็นเจ้าของบัญชีหรือผู้มีอำนาจลงนามในบัญชีที่ระบุไว้ข้างต้น";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "การให้ข้อมูลบัตร หมายความว่าคุณอนุญาตให้ %@ เรียกเก็บเงินจากบัตรสำหรับการชำระเงินในอนาคตตามเงื่อนไขของผู้ค้ารายดังกล่าว";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "การให้อีเมลหมายความว่าคุณยินยอมที่จะสร้างบัญชี Link และบันทึกข้อมูลการชำระเงินไปยัง Link ตาม<terms>ข้อกำหนด</terms>ของ Link และ<privacy>นโยบายความเป็นส่วนตัว</privacy>";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "เมื่อให้ข้อมูลการชำระเงินและยืนยันการชำระเงินนี้ หมายความว่าคุณ (ก) อนุญาตให้ %@ และ Stripe ซึ่งเป็นผู้ให้บริการชำระเงินส่งคำสั่งให้ธนาคารหักเงินจากบัญชีของคุณ และ (ข) อนุญาตให้ธนาคารหักเงินจากบัญชีตามคำสั่งดังกล่าว คุณมีสิทธิ์รับเงินคืนจากธนาคารภายใต้เงื่อนไขและข้อกำหนดซึ่งระบุไว้ในข้อตกลงที่คุณทำไว้กับธนาคาร โดยจะต้องทำการขอเงินคืนภายใน 8 สัปดาห์นับจากวันที่มีการหักเงินจากบัญชี คุณสามารถดูสิทธิ์ของตัวเองได้ในใบแจ้งยอดบัญชีที่ขอได้จากธนาคาร คุณตกลงที่จะรับการแจ้งเตือนเกี่ยวกับการหักเงินในบัญชีในอนาคตสูงสุดไม่เกิน 2 วันก่อนที่จะถึงวันหักจริง";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "การให้หมายเลขโทรศัพท์หมายความว่าคุณยินยอมที่จะสร้างบัญชี Link และบันทึกข้อมูลการชำระเงินไปยัง Link ตาม<terms>ข้อกำหนด</terms>และ<privacy>เงื่อนไข</privacy>ของ Link";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "การบันทึกบัญชีธนาคารของ %@ หมายความว่าคุณตกลงที่จะอนุมัติการชำระเงินซึ่งดำเนินการตาม<terms>ข้อกำหนดเหล่านี้</terms>";

"By submitting your order to %@ and %@, you agree to save your information with %@ for future purchases, and agree to authorize payments pursuant to <terms>these terms</terms>." = "การส่งคำสั่งซื้อของคุณไปยัง %1$@ และ %2$@ หมายความว่าคุณตกลงที่จะบันทึกข้อมูลไว้กับ %3$@ สำหรับการซื้อในอนาคต และตกลงที่จะอนุมัติการชำระเงินตาม<terms>ข้อกำหนดเหล่านี้</terms>";

"By submitting your order to %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "การส่งคำสั่งซื้อให้ %@ หมายความว่าคุณตกลงที่จะอนุมัติการชำระเงินตาม<terms>ข้อกำหนดเหล่านี้</terms>";

"CPF/CPNJ" = "AU Direct Debit";

"Cancel and pay another way" = "ยกเลิกและชำระเงินด้วยวิธีอื่น";

"Card details cannot be changed." = "เปลี่ยนแปลงรายละเอียดบัตรไม่ได้";

"Change" = "เปลี่ยน";

"Choose a payment method" = "เลือกวิธีการชำระเงิน";

"Close card scanner" = "ปิดโปรแกรมสแกนบัตร";

"Code sent" = "ส่งรหัสแล้ว";

"Confirm" = "ยืนยัน";

"Confirm it's you" = "ยืนยันว่าเป็นคุณจริงๆ";

"Confirm payment details" = "ยืนยันรายละเอียดการชำระเงิน";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "ยืนยันการชำระเงินในแอปของธนาคารหรือแอปชำระเงินภายใน %@ เพื่อชำระเงินให้เสร็จสิ้น";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "ยืนยันการชำระเงินในแอปของธนาคารภายใน %@ เพื่อชำระเงินให้เสร็จสิ้น";

"Confirm your CVC" = "ยืนยัน CVC ของคุณ";

"Contact information" = "ข้อมูลติดต่อ";

"Continue another way" = "ดำเนินการต่อด้วยวิธีอื่น";

"Create an account with Link for faster checkout across the web" = "สร้างบัญชีด้วย Link เพื่อการชำระเงินบนเว็บที่รวดเร็วขึ้น";

"Debit or credit card" = "บัตรเดบิตหรือบัตรเครดิต";

"Default" = "ค่าเริ่มต้น";

"Default payment method" = "วิธีการชำระเงินตามค่าเริ่มต้น";

"Did you mean %@? %@." = "คุณหมายถึง %1$@ ใช่หรือไม่ %2$@";

"EPS Bank" = "EPS Bank";

"Enter address manually" = "ป้อนที่อยู่ด้วยตนเอง";

"Enter the code sent to %@." = "ป้อนรหัสที่เราส่งให้ที่ %s";

"FPX Bank" = "FPX Bank";

"Failed to connect" = "เชื่อมต่อไม่สำเร็จ";

"Fast, secure checkout" = "การชำระเงินที่รวดเร็วและปลอดภัย";

"Get %@ back when you pay for the first time with your bank. <terms>See terms</terms>" = "รับคืน %@ เมื่อชำระครั้งแรกผ่านธนาคาร <terms>ดูข้อกำหนด</terms>";

"Get %@ back when you pay with your bank. <terms>See terms</terms>" = "รับคืน %@ เมื่อชำระผ่านธนาคาร <terms>ดูข้อกำหนด</terms>";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "ฉันเข้าใจว่า Stripe จะดำเนินการหักบัญชีอัตโนมัติในนามของ %@ และยืนยันว่าฉันเป็นเจ้าของบัญชีและเป็นบุคคลเดียวเท่านั้นที่อนุญาตให้หักเงินจากบัญชีนี้ได้";

"IBAN" = "IBAN";

"Log in or sign up" = "เข้าสู่ระบบหรือลงทะเบียน";

"Log out of Link" = "ออกจากระบบ Link";

"Manage SEPA debit" = "จัดการการหักบัญชีอัตโนมัติแบบ SEPA";

"Manage US bank account" = "จัดการบัญชีธนาคารในสหรัฐอเมริกา";

"Manage bank account" = "จัดการบัญชีธนาคาร";

"Manage card" = "จัดการบัตร";

"Manage cards" = "จัดการบัตร";

"Manage payment method" = "จัดการวิธีการชำระเงิน";

"Manage payment methods" = "จัดการวิธีการชำระเงิน";

"Manage your payment methods" = "จัดการวิธีการชำระเงินของคุณ";

"Name on card" = "ชื่อบนบัตร";

"New card" = "บัตรใหม่";

"New payment method" = "วิธีการชำระเงินใหม่";

"No %@ promo" = "ไม่มีโปรโมชัน %@";

"Not you?" = "หากไม่ใช่คุณ";

"Only card brand can be changed." = "เปลี่ยนได้เฉพาะแบรนด์บัตรเท่านั้น";

"Open your UPI app to approve your payment within %@" = "เปิดแอป UPI เพื่ออนุมัติการชำระเงินของคุณภายใน %@";

"Or" = "หรือ";

"Or pay using" = "หรือชำระเงินด้วย";

"Or pay with a card" = "หรือชำระเงินด้วยบัตร";

"Or use" = "หรือใช้";

"Or use a card" = "หรือใช้บัตร";

"Pay %@" = "ชำระ %@";

"Pay another way" = "ชำระด้วยวิธีอื่น";

"Pay faster at %@ and thousands of businesses." = "ชำระเงินใน %@ และธุรกิจอีกนับพันแห่งได้เร็วขึ้น";

"Pay faster everywhere Link is accepted." = "ชำระเงินได้รวดเร็วขึ้นในทุกที่ที่รองรับ Link";

"Pay over time with %@" = "ทยอยชำระเงินด้วย Affirm%@";

"Pay over time with Affirm" = "ทยอยชำระเงินด้วย Affirm";

"Pay with Link" = "ชำระเงินด้วย Link";

"Pay with your bank account in just a few steps." = "ชำระเงินด้วยบัญชีธนาคารภายในไม่กี่ขั้นตอน";

"Payment" = "การชำระเงิน";

"Payment failed" = "ชำระเงินไม่สำเร็จ";

"Payment methods" = "วิธีการชำระเงิน";

"Please choose a valid payment method." = "โปรดเลือกวิธีการชำระเงินที่ถูกต้อง";

"Please go back and select another payment method" = "โปรดย้อนกลับและเลือกวิธีการชำระเงินอื่น";

"Point the camera at your card." = "หันกล้องไปที่บัตร";

"Processing..." = "กำลังประมวลผล...";

"Przelewy24 Bank" = "ธนาคาร Przelewy24";

"Remove card?" = "นำบัตรออกไหม";

"Remove linked account" = "นำบัญชีที่ลิงก์ไว้ออก";

"Resend code" = "ส่งรหัสอีกครั้ง";

"SEPA debit details cannot be changed." = "เปลี่ยนแปลงรายละเอียดการหักบัญชีอัตโนมัติแบบ SEPA ไม่ได้";

"Save" = "บันทึก";

"Save a new payment method" = "บันทึกวิธีการชำระเงินใหม่";

"Save address" = "บันทึกที่อยู่";

"Save for future payments" = "บันทึกไว้เพื่อชำระเงินในอนาคต";

"Save my info for faster checkout with Link" = "บันทึกข้อมูลของฉันเพื่อให้ชำระเงินด้วย Link ได้รวดเร็วขึ้น";

"Save payment details to %@ for future purchases" = "บันทึกรายละเอียดการชำระเงินไปยัง %@ เพื่อการซื้อในอนาคต";

"Save this account for future %@ payments" = "บันทึกบัญชีนี้เพื่อชำระเงินให้ %@ ในอนาคต";

"Save your bank account in just a few steps." = "บันทึกข้อมูลบัญชีธนาคารภายในไม่กี่ขั้นตอน";

"Save your info for secure 1-click checkout with Link" = "บันทึกข้อมูลของคุณไว้เพื่อการชำระเงินที่ปลอดภัยในคลิกเดียวด้วย Link";

"Saved" = "บันทึกแล้ว";

"Select card" = "เลือกบัตร";

"Select payment method" = "เลือกวิธีการชำระเงิน";

"Select your payment method" = "เลือกวิธีการชำระเงิน";

"Set as default" = "ตั้งเป็นค่าเริ่มต้น";

"Set as default payment method" = "ตั้งเป็นวิธีการชำระเงินเริ่มต้น";

"Set up" = "ตั้งค่า";

"Shipping to %@ is not supported." = "ระบบไม่รองรับการจัดส่งไปยัง%@";

"Show menu" = "แสดงเมนู";

"Simple, secure one-click payments" = "การชำระเงินด้วยคลิกเดียวที่ปลอดภัยและใช้ง่าย";

"Something went wrong when linking your account.\nPlease try again later." = "เกิดข้อผิดพลาดบางอย่างเมื่อเชื่อมโยงบัญชีของคุณ\nโปรดลองอีกครั้งในภายหลัง";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe จะฝากเงินจำนวน $0.01 ในบัญชีของคุณภายใน 1-2 วันทำการ จากนั้นคุณก็จะได้รับอีเมลแจ้งวิธีตั้งค่าบัญชีธนาคารด้วย %@";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe จะฝากเงินจำนวน $0.01 ในบัญชีของคุณภายใน 1-2 วันทำการ จากนั้นคุณก็จะได้รับอีเมลแจ้งวิธีชำระเงินแก่ %@ ให้เสร็จสิ้น";

"Tap to close" = "แตะเพื่อปิด";

"Tap to expand" = "แตะเพื่อขยาย";

"The IBAN you entered is incomplete." = "IBAN ที่คุณป้อนไม่ครบถ้วน";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "IBAN ที่คุณป้อนไม่ถูกต้อง \"%@\" ไม่ใช่รหัสประเทศที่รองรับ";

"The provided verification code has expired." = "รหัสยืนยันที่ป้อนหมดอายุแล้ว";

"The provided verification code is incorrect." = "รหัสยืนยันที่ป้อนไม่ถูกต้อง";

"This is your default" = "นี่คือค่าเริ่มต้นของคุณ";

"This payment method will be removed but will remain available for %@ subscriptions." = "วิธีการชำระเงินนี้จะถูกนำออกไปแต่จะยังคงใช้ได้สำหรับการชำระเงินตามรอบบิล %@";

"Too many attempts. Please try again in a few minutes." = "ลองหลายครั้งเกินไป โปรดลองใหม่ในอีกสักครู่";

"Unavailable for this purchase" = "ใช้กับการซื้อรายการนี้ไม่ได้";

"Update card" = "อัปเดตบัตร";

"Update payment method" = "อัปเดตวิธีการชำระเงิน";

"Use billing address for shipping" = "ใช้ที่อยู่เรียกเก็บเงินสำหรับการจัดส่ง";

"View more" = "ดูเพิ่มเติม";

"Yes, update" = "ใช่ อัปเดต";

"Your IBAN should start with a two-letter country code." = "IBAN ควรเริ่มต้นด้วยรหัสประเทศ 2 ตัวอักษร";

"iDEAL Bank" = "ธนาคารที่รองรับ iDEAL";
